;***********************説明********************************
;このスクリプトは記号を入力した際にクリップボードを経由することで
;直接入力となるスクリプト

;適用キーを以下に示す
; 数字キー[ 1 ] + [shift] → [ ! ]
; 数字キー[ 2 ] + [shift] → [ " ]
; 数字キー[ 3 ] + [shift] → [ # ]
; 数字キー[ 4 ] + [shift] → [ $ ]
; 数字キー[ 5 ] + [shift] → [ % ]
; 数字キー[ 6 ] + [shift] → [ & ]
; 数字キー[ 7 ] + [shift] → [ ' ]
; 数字キー[ 8 ] + [shift] → [ ( ]
; 数字キー[ 9 ] + [shift] → [ ) ]
; 記号キー[ - ] + [shift] → [ = ]
; 記号キー[ ^ ] + [shift] → [ ~ ]
; 記号キー[ ¥ ] + [shift] → [ | ]
; 記号キー[ @ ] + [shift] → [ ` ]
; 記号キー[ [ ] + [shift] → [ { ]
; 記号キー[ ] ] + [shift] → [ } ]
; 記号キー[ ; ] + [shift] → [ + ] 
; 記号キー[ : ] + [shift] → [ * ]
; 記号キー[ , ] + [shift] → [ < ]
; 記号キー[ . ] + [shift] → [ > ]
; 記号キー[ / ] + [shift] → [ ? ]
; 記号キー[ \ ]           → [ _ ]
; 記号キー[ \ ] + [shift] → [ _ ]

;適用キーを以下に示す
; 記号キー[ - ] + [capslock] → [ - ]
; 記号キー[ ^ ] + [capslock] → [ ^ ]
; 記号キー[ ¥ ] + [capslock] → [ ¥ ]
; 記号キー[ [ ] + [capslock] → [ [ ]
; 記号キー[ ] ] + [capslock] → [ ] ]
; 記号キー[ ; ] + [capslock] → [ ; ] 
; 記号キー[ : ] + [capslock] → [ : ]
; 記号キー[ , ] + [capslock] → [ , ]
; 記号キー[ . ] + [capslock] → [ . ]
; 記号キー[ \ ] + [capslock] → [ _ ]

; 記号キー[ - ] + [capslock] は罫線に使用済み
; 記号キー[ / ] + [capslock] はコメントアウトに使用済み
; 記号キー[ @ ] + [capslock] はコードブロックに使用済み

; 記号キー[ ^ ] + [capslock] → [ ^ ]
F13 & ^::InsertText("^")
; 記号キー[ ¥ ] + [capslock] → [ ¥ ]
F13 & \::InsertText("\")
; 記号キー[ [ ] + [capslock] → [ [ ]
F13 & [::InsertText("[")
; 記号キー[ ] ] + [capslock] → [ ] ]
F13 & ]::InsertText("]")
; 記号キー[ , ] + [capslock] → [ , ]
F13 & SC033::InsertText(",")
; 記号キー[ . ] + [capslock] → [ . ]
F13 & .::InsertText(".")
; 記号キー[ \ ] + [capslock] → [ _ ]
F13 & SC073::InsertText("_")

