; ====================追加ショートカット====================


#c::Run("calc.exe") ;[win] + [c] -> [電卓を起動]

#!Up::MouseMove(0,-40,1,"R")   ;[win] + [Alt] + [↑] -> [マウスカーソル移動(上)]
#!Down::MouseMove(0,40,1,"R")  ;[win] + [Alt] + [↓] -> [マウスカーソル移動(下)]
#!Left::MouseMove(-40,0,1,"R") ;[win] + [Alt] + [←] -> [マウスカーソル移動(左)]
#!Right::MouseMove(40,0,1,"R") ;[win] + [Alt] + [→] -> [マウスカーソル移動(右)]


; ====================既存のショートカットの有効化・無効化====================

; #a::アクションセンターを表示/非表示(標準)
#b::Return ;[win] + [b] -> [無し]
; #d::デスクトップを表示する(標準)
; #e::エクスプローラーを起動する(標準)
#f::Return 
; #g::Xboxゲームバーを表示(標準)
#h::Return
; #i::設定ウィンドウを開く(標準)
#j::Return
; #k::  ;デバイスの接続画面を開く(標準)
; #l::  ;パソコンの画面をロック(標準)
#m::Return
#n::Return
;#p::  外部ディスプレイへ出力(標準)
#q::Return ;Windows（アプリ、ファイル、設定）の検索を表示(標準)
;#r::  ;ファイル名を指定して実行(標準)
#s::Return ;タスクバーの検索ボックスにカーソルを移動(標準)
;#t::       ;タスクバーでアプリを切り替える(標準)
#u::Return ;Windowsの設定の「簡単操作」を起動(標準)
;#v::  ;クリップボードの履歴を表示(標準)
#w::Return ;Windows Ink ワークスペース(標準)
#x::Return ;クイックアクセスメニューを表示(標準)
#y::Return
#z::Return


; ====================既存のショートカット====================

;[Win] + [Ctrl] + [→] -> [仮想デスクトップの切り替え（複数ある場合）(標準)]
;[Win] + [Ctrl] + [←] -> [仮想デスクトップの切り替え（複数ある場合）(標準)]
;[Win] + [Ctrl] + [F4] -> [使用中の仮想デスクトップを閉じる(標準)]
;[Win] + [Shift] + [M] -> [最小化したウィンドウを表示(標準)]
;[Win] + [Shift] + [S] -> [スクリーンショットの撮影(標準)]
;[Win] + [Shift] + [<] -> [サブディスプレイにウィンドウを移動(標準)]
;[Win] + [Shift] + [>] -> [サブディスプレイにウィンドウを移動(標準)]
;[Win] + [Pause] -> [システム画面を開く(標準)]
;[Win] + [PrintScreen] -> [スクリーンショットを撮影して保存(標準)]
;[Win] + [Tab] -> [タスクビューを表示（アプリ切り替え）、タイムライン(標準)]
;[Win] + [Home] -> [最前面のウィンドウ（アクティブ・ウィンドウ）以外を最小化(標準)]
;[Win] + [.] -> [キーボードから絵文字・顔文字を追加(標準)]
;[Win] + [,] -> [全ウィンドウを一時的に透明に(標準)]
;[Win] + [+] -> [拡大鏡をオンに/拡大鏡の拡大(標準)]
;[Win] + [–] -> [拡大鏡の縮小(標準)]
;[Win] + [Esc] -> [拡大鏡をオフに(標準)]
;[Win] + [数字]キー -> [タスクバーのアプリを起動(標準)]
;[Win] + [Alt] + [数字キー] -> [タスクバーのアプリの右クリックメニューを表示(標準)]
;[Win] + [↑] -> [アクティブなウィンドウを最大化(標準)]
;[Win] + [↓] -> [アクティブなウィンドウを元に戻す（2度押しで最小化する）(標準)]
;[Win] + [←] -> [アクティブなウィンドウを左半分に配置(標準)]
;[Win] + [→] -> [アクティブなウィンドウを右半分に配置(標準)]
;[Win] + [Shift] + [↑] -> [アクティブなウィンドウを上下いっぱいに表示(標準)]
;[Win] + [Alt] + [D] -> [日付と時刻を表示(標準)]

;***装飾キーメモ***
;キー名	説明  
; +	   shift             
; ^	   control   
; !	    alt      
; #	   windows	    
;*****************
