

;USキーボードの｢半角・全角｣を押したときのキーを入力
^+7::Send("{SC029}")                               ;[Ctrl] + [Shift] + [7] -> [`]

F13::F5                                         ;[CapsLock] -> [F5]
F14::F6                                         ;[無変換] -> [F6]


;***********装飾キーメモ************/
;キー名 説明                        /
; +    shift                       /
; ^    control                     /
; !     alt                        /
; #    windows                     /
;**********************************/

